z=[]
while True:
    a = input('ร้านชำเมอร์ริเซ่\n เพิ่ม [a]\n แสดง [s]\n ออกจากระบบ [x]\n')
    a = a.lower()
    if a=='a' :
        c = input('ป้อนรายการลูกค้า(รหัสสมาชิก:ชื่อ:สินค้าที่ซื้อ)')
        z.append(c)
        print('\n*********ข้อมูลได้เข้าสู่ระบบ********\n')
    elif a == 's':
        print('{0:-<30}'.format(""))
        print('{0:-<6}{1:-<10}{2:-<10}'.format('รหัสสมาชิก','ชื่อ','สินค้าที่ซื้อ'))
        print('{0:-<6}{0:-<10}{0:-<10}'.format(""))
        for d in z:
            e = d.split(":")
            print('{0[0]:<6} {0[1]:<10} ({0[2]:<10})'.format(e))
            continue
    elif a =='x' :
        c = input("ต้องการปิดโปรแกรมใช่หรือไม่ y/n: ")
        if c =="y":
            print("ขอบคุณที่ใช้บริการ")
            break
        else : 
            continue