print("\tโปรแกรมคำนวณค่าผ่านทางมอเตอร์เวย์")
print("-"*50)
print("\tรถยนต์ 4 ล้อ กด 1")
print("\tรถยนต์ 6 ล้อ กด 2")
print("\tรถยนต์มากกว่า 6 ล้อ กด 3")
car1list =["ลาดกระบัง-->บางบ่อ:25 บาท","ลาดกระบัง-->บางประกง:30 บาท","ลาดกระบัง-->พัสนิคม:45 บาท","ลาดกระบัง-->บ้านบึง:55 บาท","ลาดกระบัง-->บางพระ:60 บาท"]
car2list =["ลาดกระบัง-->บางบ่อ:40 บาท","ลาดกระบัง-->บางประกง:45 บาท","ลาดกระบัง-->พัสนิคม:75 บาท","ลาดกระบัง-->บ้านบึง:90 บาท","ลาดกระบัง-->บางพระ:100 บาท"]
car3list =["ลาดกระบัง-->บางบ่อ:60 บาท","ลาดกระบัง-->บางประกง:70 บาท","ลาดกระบัง-->พัสนิคม:100 บาท","ลาดกระบัง-->บ้านบึง:130 บาท","ลาดกระบัง-->บางพระ:140 บาท"]
car = int(input("\tเลือกประเภทยานยนต์พาหนะ : """))
if car == 1:
    print("\tค่าบริการรถยนต์ 4 ล้อ")
    for x in car1list:
        print("\n",x)
elif car == 2:
    print("\tค่าบริการถยนต์ 6 ล้อ")
    for x in car2list:
        print("\n",x)
elif car == 3:
    print("\tค่าบริการรถยนต์ 6 ล้อขึ้นไป")
    for x in car3list:
        print("\n",x)